In [2]:
import pandas as pd

filepath = '../datasets/athletes/'

data_main = pd.read_csv(filepath + 'Medals.csv', encoding = 'ISO-8859-1')

In [4]:
data_main.head()

            Athlete   Age     ...       Bronze Medals Total Medals
0    Michael Phelps  23.0     ...                   0            8
1    Michael Phelps  19.0     ...                   2            8
2    Michael Phelps  27.0     ...                   0            6
3  Natalie Coughlin  25.0     ...                   3            6
4     Aleksey Nemov  24.0     ...                   3            6

[5 rows x 8 columns]

In [5]:
a = data_main["Athlete"].unique().tolist()

In [6]:
len(a)

6956

In [7]:
data_main.shape

(8618, 8)

In [9]:
data_country = pd.read_csv(filepath + 'Athelete_Country_Map.csv', encoding = 'ISO-8859-1')

In [10]:
data_country.head()

            Athlete        Country
0    Michael Phelps  United States
1  Natalie Coughlin  United States
2     Aleksey Nemov         Russia
3     Alicia Coutts      Australia
4    Missy Franklin  United States

In [11]:
data_country[data_country["Athlete"] == "Aleksandar Ciric"]

               Athlete                Country
1029  Aleksandar Ciric                 Serbia
1086  Aleksandar Ciric  Serbia and Montenegro

In [13]:
data_sports = pd.read_csv(filepath + 'Athelete_Sports_Map.csv', encoding = 'ISO-8859-1')

In [15]:
data_sports.head()

            Athlete       Sport
0    Michael Phelps    Swimming
1  Natalie Coughlin    Swimming
2     Aleksey Nemov  Gymnastics
3     Alicia Coutts    Swimming
4    Missy Franklin    Swimming

In [16]:
len(data_sports)

6975